{
    "common": {
        "title": {
            "en": "resume | ZocketZero",
            "th": "เรซูเม่ | ZocketZero"
        },
        "source": "github.com/ZocketZero/resume"
    },
    "personal": {
        "name": {
            "en": "Nawasan Wisitsingkhon",
            "th": "ณวสันต์ วิศิษฏ์ศิงขร"
        },
        "description": {
            "en": "Inexperienced software developer looking for a job related to software development to gain experience. I have knowledge in developing web applications, both Backend and Frontend, with popular frameworks and popular databases. Also has knowledge in using Linux for running various services, including using Docker in various forms, and has knowledge of networking for configuring various devices and using Software-defined Network and finally has knowledge in cybersecurity.",
            "th": "นักพัฒนาซอฟต์แวร์ที่ไม่มีประสบการณ์กำลังมองหางานเพื่อหาประสบการณ์ มีความรู้ในการพัฒนาเว็บแอปพลิเคชั่น ทั้ง Backend และ Frontend ด้วยเฟรมเวิร์กและฐานข้อมูลยอดฮิต มีความรู้ในการใช้งาน Linux สำหรับการรัน service ต่าง ๆ รวมถึงการใช้งาน Docker ในรูปแบบต่างๆ ทั้งยังมีความรู้ด้านเน็ตเวิร์กสำหรับการกำหนดค่าอุปกรณ์ต่างๆ รวมถึงการใช้งาน Software-defined Network และสุดท้ายมีความรู้ด้านความปลอดภัยทางไซเบอร์"
        },
        "github": "ZocketZero",
        "email": "contact@nawasan.dev",
        "linkedin": "nawasan",
        "website": "nawasan.dev",
        "location": {
            "th": "วารินชำราบ อุบลราชธานี 34190",
            "en": "Warinchamrap, Ubon Ratchathani 34190"
        }
    },
    "skills": {
        "programming": "Typescript, Rust, Python, PHP, Golang, C/C++",
        "frameworks": "NextJS, React, Svelte, Astro, Nest.js, Tailwindcss, ExpressJS, EJS",
        "tools": "Linux, Docker, Git, Github Action, vim, MySQL, MongoDB, Firebase, Vscode",
        "networks": "network administration, Software-defined network, Openflow"
    },
    "projects": [
        {
            "name": "Online shop",
            "description": {
                "en": "A small shopping web project from a web programming class that has an ordering system, product management and user accounts.",
                "th": "โปรเจกต์เว็บขายของเล็ก ๆ จากห้องเรียนการเขียนโปรแกรมบนเว็บ ที่มีระบบการสั่งซื้อ จัดการสินค้า และบัญชีผู้ใช้"
            },
            "tech": "Full-Stack, Javascript, Nextjs, Express, Prisma, Mongodb, jsonwebtoken",
            "link": "github.com/ZocketZero/final-exam"
        },
        {
            "name": "Tenjin",
            "description": {
                "en": "SDN and Openflow protocol that can control and command the operation of supported network devices. It has a built-in basic controller that can be called via the command line.",
                "th": "เฟรมเวิร์ก SDN และโปรโตคอล Openflow ที่สามารถควบคุมสั่งการการทำงานของอุปกรณ์เน็ตเวิร์กที่รองรับ มีคอนโทรลเลอร์พื้นฐานในตัวที่สามารถเรียกใช้ผ่าน command line"
            },
            "tech": "Rust, Networks, command line, CI/CD, crates.io",
            "link": "github.com/ZocketZero/Tenjin"
        },
        {
            "name": "Social web",
            "description": {
                "en": "The website Project has a user account system, admin, posts, and threads.",
                "th": "เว็บไซต์้โปรเจกจบระดับ ปวส มีระบบบัญชีผู้ใช้งาน แอดมิน โพสต์ ตั้งกระทู้"
            },
            "tech": "Full-Stack, PHP, MySQL, Tailwindcss, Docker",
            "link": "github.com/ZocketZero/social-web-php"
        }
    ],
    "competitions": {
        "en": [
            {
                "name": "Digital Business Innovation Development",
                "level": "Ranked 4th in the regional level",
                "year": "2022",
                "certificates": "nawasan.dev/certificates/5"
            }
        ],
        "th": [
            {
                "name": "ทักษะการพัฒนานวัตกรรมธุรกิจดิจิทัล",
                "level": "อันดับที่ 4 ในระดับภูมิภาค",
                "year": "2022",
                "certificates": "nawasan.dev/certificates/5"
            }
        ]
    },
    "Education": [
        {
            "level": {
                "en": "Higher Vocational Certificate, Business Computer",
                "th": "ประกาศนียบัตรวิชาชีพชั้นสูง คอมพิวเตอร์ธุรกิจ"
            },
            "school": {
                "en": "Warinchamrap Vocational College",
                "th": "วิทยาลัยการอาชีพวารินชำราบ"
            },
            "gpa": "3.24",
            "years": "2021 - 2023"
        },
        {
            "level": {
                "en": "Vocational Certificate, Business Computer",
                "th": "ประกาศนียบัตรวิชาชีพ คอมพิวเตอร์ธุรกิจ"
            },
            "school": {
                "en": "Warinchamrap Vocational College",
                "th": "วิทยาลัยการอาชีพวารินชำราบ"
            },
            "gpa": "3.26",
            "years": "2017 - 2021"
        }
    ]
}